In [32]:
import pandas as pd
import seaborn as sns

In [33]:
df = sns.load_dataset('titanic')
df.head(6)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [34]:
df['age'].isnull().sum()

177

In [35]:
df['age'] = df['age'].fillna(0)

In [36]:
df['age'].isnull().sum()

0

In [37]:
int_age = df['age'].astype('int64')
int_age.head()

0    22
1    38
2    26
3    35
4    35
Name: age, dtype: int64

In [38]:
df['int_age'] = int_age
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,int_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35

In [39]:
df.loc[5,'int_age']

0

In [40]:
df.loc[5, 'int_age'] = 35
df.loc[5,'int_age']

35

In [41]:
df.loc[10:15, 'int_age']

10     4
11    58
12    20
13    39
14    14
15    55
Name: int_age, dtype: int64

In [42]:
df.loc[10:15, 'int_age'] = df.loc[10:15, 'int_age'].mean().astype('int64')
df.loc[10:15, 'int_age']

10    31
11    31
12    31
13    31
14    31
15    31
Name: int_age, dtype: int64